In [1]:
import pandas as pd
import numpy as np

## Чтение данных из csv файла

In [3]:
sp_dataframe = pd.read_csv('StudentsPerformance.csv')

In [5]:
sp_dataframe

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

## Базовые команды с датафреймом

In [14]:
sp_dataframe.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [16]:
sp_dataframe.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

In [18]:
sp_dataframe.shape

(1000, 8)

## Работа с индексами

In [25]:
sp_dataframe.groupby('gender').aggregate({'writing score' : 'mean'})

        writing score
gender
female      72.467181
male        63.311203

In [26]:
sp_dataframe.iloc[0:5, 0:3]

   gender race/ethnicity parental level of education
0  female        group B           bachelor's degree
1  female        group C                some college
2  female        group B             master's degree
3    male        group A          associate's degree
4    male        group C                some college

In [4]:
sp_dataframe.iloc[0:5, [i for i in range(0, sp_dataframe.columns.size, 2)]]

   gender parental level of education test preparation course  reading score
0  female           bachelor's degree                    none             72
1  female                some college               completed             90
2  female             master's degree                    none             95
3    male          associate's degree                    none             57
4    male                some college                    none             78

In [9]:
selected = sp_dataframe.iloc[[0, 3, 4, 7, 8]]

In [11]:
selected.index = ['A', 'B', 'C', 'D', 'E']

In [13]:
selected

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
A,female,group B,bachelor's degree,standard,none,72,72,74
B,male,group A,associate's degree,free/reduced,none,47,57,44
C,male,group C,some college,standard,none,76,78,75
D,male,group B,some college,free/reduced,none,40,43,39
E,male,group D,high school,free/reduced,completed,64,64,67

In [17]:
selected.loc[['A', 'C'], ['gender', 'math score', 'reading score']]

   gender  math score  reading score
A  female          72             72
C    male          76             78

## Что есть датафрейм
Датафрейм, по сути, является набором серий (массивов)

In [32]:
selected.iloc[:, 0]

A    female
B      male
C      male
D      male
E      male
Name: gender, dtype: object

In [34]:
type(selected.iloc[:, 0])

pandas.core.series.Series

In [37]:
pd.Series([1, 2, 3], index=['A', 'B', 'C'])

A    1
B    2
C    3
dtype: int64

In [38]:
series_1 = pd.Series([1, 2, 3], index=['A', 'B', 'C'])
series_2 = pd.Series([4, 5, 6], index=['A', 'B', 'C'])

In [41]:
pd.DataFrame({'col_1' : series_1, 'col_2' : series_2})

   col_1  col_2
A      1      4
B      2      5
C      3      6

In [44]:
selected['gender'] # серия

A    female
B      male
C      male
D      male
E      male
Name: gender, dtype: object

In [52]:
selected[['gender']] # датафрейм

   gender
A  female
B    male
C    male
D    male
E    male

In [54]:
selected['gender'].shape

(5,)

In [57]:
selected[['gender']].shapepe

AttributeError: 'DataFrame' object has no attribute 'shapepe'

## Выберите все подходящие ответы из списка
```python
df.head(7)
df.iloc[:7]
df.iloc[0:7]
df.loc[:6]
```

## Сопоставьте значения из двух списков
```python
df.get_dtype_counts() # возвращает серию с числом колонок каждого из типов
df.shape # возвращает кортеж из числа строк и столбцов у df
df.index # возвращает коллекцию с индексом всех строк
df.dtypes # возвращает серию с описанием типа каждой колонки 
df.select_dtypes # возвращает часть датафрэйма, куда были включены колонки с типами, указанными в include, или исключены колонки с типами, указанными в exclude
df.size # возвращает число ячеек (число строк, умноженное на число столбцов) в df
df.columns # возвращает коллекцию с названиями колонок
```

## Заполните пропуски

In [97]:
titanic_df = pd.read_csv('titanic.csv')
titanic_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [99]:
titanic_df.shape # чилсло строк и колонок

(891, 12)

In [100]:
titanic_df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [104]:
float_cnt = 0
int_cnt = 0
obj_cnt = 0

for t in titanic_df.dtypes.array:
    if t == 'float64':
        float_cnt += 1
    elif t == 'int64':
        int_cnt += 1
    elif t == 'object':
        obj_cnt += 1

print(f'float: {float_cnt}, int: {int_cnt}, object: {obj_cnt}')

float: 2, int: 5, object: 5